//File/process hash match related to the MOONRISE RAT
let MoonriseHashes = dynamic([
  "c7fd265b23b2255729eed688a211f8c3bd2192834c00e4959d1f17a0b697cd5e",
  "8a422b8c4c6f9a183848f8d3d95ace69abb870549b593c080946eaed9e5457ad",
  "7609c7ab10f9ecc08824db6e3c3fa5cbdd0dff2555276e216abe9eebfb80f59b",
  "ed5471d42bef6b32253e9c1aba49b01b8282fd096ad0957abcf1a1e27e8f7551",
  "082fdd964976afa6f9c5d8239f74990b24df3dfa0c95329c6e9f75d33681b9f4",
  "8d7c1bbdb6a8bf074db7fc1185ffd59af0faffb08e0eb46a373c948147787268"
]);
DeviceProcessEvents
| where TimeGenerated > ago(24h)
| where SHA256 in (MoonriseHashes)
| project TimeGenerated, DeviceName, AccountName, FileName, FolderPath, ProcessCommandLine,
          InitiatingProcessFileName, InitiatingProcessFolderPath, InitiatingProcessCommandLine,
          SHA256, ReportId
| extend HostCustomEntity = DeviceName, AccountCustomEntity = AccountName
