let suspiciousUserAgents = externaldata(http_user_agent: string)[@"https://raw.githubusercontent.com/mthcht/awesome-lists/main/Lists/suspicious_http_user_agents_list.csv"] 
    with (format="csv", ignoreFirstRecord=True)
| project http_user_agent 
| extend http_user_agent = tostring(http_user_agent)
| extend http_user_agent = replace_string(http_user_agent, "/*", ""); // Remove forward slashes and asterisks
let queryInterval = 1h;
union AADNonInteractiveUserSignInLogs, SigninLogs
| where TimeGenerated >= ago(queryInterval)
| where UserAgent has_any (suspiciousUserAgents) 
| extend AuthenticationResult = iff(ResultType == 0, "Success", "Failure")
| where AuthenticationResult contains "Success"
| extend geoinfo = geo_info_from_ip_address(IPAddress)
| extend Country = tostring(geoinfo.country)
| where Country !in ("New Zealand", "Australia")
// Filter out known legitimate user agents
| where not(UserAgent startswith "Mozilla/")
| where not(UserAgent startswith "azsdk-python-identity/")
| where not(UserAgent startswith "azsdk-net-Identity/")
| where not(UserAgent startswith "Microsoft%20Teams/")
| where not(UserAgent startswith "Microsoft%20Teams%20classic/")
| where not(UserAgent startswith "Microsoft.Data.Mashup")
| where not(UserAgent startswith "Microsoft%20Authenticator/")
| where not(UserAgent startswith "NONISV|SharePointPnP|PnPCore/")
| where not(UserAgent startswith "Mac%20SSO%20Extension/")
| where not(UserAgent startswith "Company%20Portal/")
| where not(UserAgent startswith "Go-http-client/")
| where not(UserAgent startswith "accountsd/")
| where not(UserAgent startswith "PAN GlobalProtect/")
| where not(UserAgent startswith "Microsoft ASP.NET Core OpenIdConnect handler")
| where not(UserAgent startswith "BAV2ROPC")
| where not(UserAgent startswith "Microsoft SkyDriveSync" and UserAgent contains "Windows NT") //OneDrive sync agent
| where not(UserAgent startswith "lua-resty-http" and UserAgent contains "ngx_lua") // ServiceNow Teams integration
// Exclude mobile user agents
| where not(UserAgent startswith "Dalvik/" and UserAgent contains " (Linux; U; Android ")
| where not(UserAgent startswith "Outlook/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad"))
| where not(UserAgent startswith "TeamSpaceShareExtension/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad"))
| where not(UserAgent startswith "AuthenticatorSSOExtension/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad"))
| where not(UserAgent startswith "SharePoint/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad"))
| where not(UserAgent startswith "OneNote/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad"))
| where not(UserAgent startswith "OfficeLens/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad"))
| where not(UserAgent startswith "ControlFilter/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad"))
| where not(UserAgent startswith "Settings/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad" or UserAgent contains "Darwin/"))
| where not(UserAgent startswith "OneDrive/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad" or UserAgent contains "Darwin/"))
| where not(UserAgent startswith "Designer/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad" or UserAgent contains "Darwin/"))
| where not(UserAgent startswith "Office/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad" or UserAgent contains "Darwin/"))
| where not(UserAgent startswith "Microsoft%20Defender%20for%20Endpoint/" and (UserAgent contains " ;iPhone" or UserAgent contains " ;iPad" or UserAgent contains "Darwin/"))
| where not(UserAgent startswith "Cortex/" and UserAgent contains "Darwin/")
| where not(UserAgent startswith "InternetAccountsSettingsExtension/" and UserAgent contains "Darwin/")
| where not(UserAgent startswith "Calendar/" and UserAgent contains "Darwin/")
// project results
| project TimeGenerated,Type,UserPrincipalName,UserAgent,IPAddress,Country,MfaDetail_dynamic